In [1]:
import pandas as pd 
import datetime as dt
import matplotlib.pyplot as plt

In [2]:
#Reading 5 years of SP500 data from .csv file
df = pd.read_csv('all_stocks_5yr.csv')
df['Date'] = pd.to_datetime(df['Date'], format='%d/%m/%Y')

In [3]:
investment = 100000
strategy_TOP10_return = list()

In [4]:
for i in range(2013,2015):
    # top 10 companies in last 2 years
    df1 = df.loc[df['Date'].dt.year == i]
    companies = df1['Name'].drop_duplicates().tolist()
    table1 = pd.DataFrame(companies)
    table1 = table1.rename(columns = {0:'Company Name'})
    START_share_price_previous_year = list()
    END_share_price_previous_year = list()
table1.head(10)

  Company Name
0          AAL
1         AAPL
2          AAP
3         ABBV
4          ABC
5          ABT
6          ACN
7         ADBE
8          ADI
9          ADM

In [5]:
for name in companies:
    min_date = df1.query('Name == "{}"'.format(name))['Date'].min()
    START_share_price_previous_year.append(df1['Close'][(df1['Date'] == min_date)&(df1['Name'] == name)].item())
    max_date = df1.query('Name == "{}"'.format(name))['Date'].max()
    END_share_price_previous_year.append(df1['Close'][(df1['Date'] == max_date)&(df1['Name'] == name)].item())

In [6]:
df1.head(10)

          Date   open     high    low   Close    volume Name
226 2014-01-02  25.07  25.8200  25.06  25.360   8998943  AAL
227 2014-01-03  25.75  26.7500  25.51  26.540  13836062  AAL
228 2014-01-06  26.62  27.2000  26.60  27.030  11272273  AAL
229 2014-01-07  27.20  27.3997  26.67  26.905  11288775  AAL
230 2014-01-08  26.37  27.6800  26.35  27.630  15736891  AAL
231 2014-01-09  28.24  29.6000  28.20  29.420  26056445  AAL
232 2014-01-10  29.05  29.8300  28.75  29.350  12824160  AAL
233 2014-01-13  29.18  29.5300  28.58  28.650  10591701  AAL
234 2014-01-14  28.75  29.0400  28.71  28.870  10601529  AAL
235 2014-01-15  28.90  29.4400  28.70  28.840  11192558  AAL

In [7]:
    table1['Start Share Price'] = START_share_price_previous_year
    table1['End Share Price'] = END_share_price_previous_year
    table1['Change in Share Price'] = table1['End Share Price'] - table1['Start Share Price']
    table1.sort_values('Change in Share Price', ascending=False, inplace=True)
    table2=table1.head(10)

In [8]:
print(table2)

    Company Name  Start Share Price  End Share Price  Change in Share Price
101          CMG             523.43           684.51                 161.08
56           AZO             474.11           619.11                 145.00
377         REGN             274.59           410.25                 135.66
18           AGN             168.05           257.41                  89.36
397          SHW             182.41           263.04                  80.63
233         ILMN             110.34           184.58                  74.24
341         ORLY             128.76           192.62                  63.86
312          MTD             241.53           302.46                  60.93
161          ESS             146.30           206.60                  60.30
66          BIIB             280.33           339.45                  59.12

In [9]:
#Investing part
df1 = df.loc[df['Date'].dt.year == (i+1)]
top_10_performers = table2['Company Name'].tolist()
top_10_performers_df = pd.DataFrame(top_10_performers)
top_10_performers_df = top_10_performers_df.rename(columns = {0:'Top 10 Companies'})
START_share_price_next_year = list()
END_share_price_next_year = list()
START_share_price_next_year

[]

In [10]:
for name in  top_10_performers:
    min_date = df1.query('Name == "{}"'.format(name))['Date'].min()
    START_share_price_next_year.append(df1['Close'][(df1['Date'] == min_date)&(df1['Name'] == name)].item())
    max_date = df1.query('Name == "{}"'.format(name))['Date'].max()
    max_date = df1.query('Name == "{}"'.format(name))['Date'].max()
    END_share_price_next_year.append(df1['Close'][(df1['Date'] == max_date)&(df1['Name'] == name)].item())

In [11]:
top_10_performers_df['Start Share Price'] = START_share_price_next_year

In [12]:
share_investment = investment/10

In [13]:
top_10_performers_df['Stock'] = share_investment/top_10_performers_df['Start Share Price']

In [14]:
top_10_performers_df['End Share Price'] = END_share_price_next_year

In [15]:
 top_10_performers_df['Return'] = top_10_performers_df['Stock']*top_10_performers_df['End Share Price']

In [28]:
total_return_year_after = top_10_performers_df['Return'].sum()
print(top_10_performers_df['Return'])

0     7073.260613
1    12028.567260
2    13235.566608
3    12059.583993
4     9891.784789
5    10351.903786
6    13191.400760
7    11231.329690
8    11381.507012
9     8957.340429
Name: Return, dtype: float64

In [29]:
print(total_return_year_after)

109402.24493946804

In [17]:
print((i+1))

2015

In [18]:
print(total_return_year_after)

109402.24493946804